test/tests/multiapps/heated_plate/buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

11
(
    patch0
    {
        type            patch;
        physicalType    patch;
        nFaces          1050;
        startFace       2210;
    }
    patch1
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       3260;
    }
    patch2
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       3310;
    }
    patch3
    {
        type            patch;
        physicalType    patch;
        nFaces          1050;
        startFace       3325;
    }
    patch4
    {
        type            patch;
        physicalType    patch;
        nFaces          15;
        startFace       4375;
    }
    patch5
    {
        type            patch;
        physicalType    patch;
        nFaces          70;
        startFace       4390;
    }
    patch6
    {
        type            patch;
        physicalType    patch;
        nFaces          100;
        startFace       4460;
    }
    patch7
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       4560;
    }
    patch8
    {
        type            patch;
        physicalType    patch;
        nFaces          5;
        startFace       4580;
    }
    patch9
    {
        type            patch;
        physicalType    patch;
        nFaces          100;
        startFace       4585;
    }
    patch10
    {
        type            patch;
        physicalType    patch;
        nFaces          5;
        startFace       4685;
    }
)

// ************************************************************************* //
